labs_report_hw_6/app/views/reports/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---

    <%= form.collection_select :user_id, User.order(:id),:id,:email  %>