labs_report_hw_6/app/controllers/reports_controller.rb

  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save
---
INSERT INTO "reports" ("title", "description", "mark", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ff"], ["description", "fff"], ["mark", 4], ["created_at", "2023-08-12 11:43:44.468470"], ["updated_at", "2023-08-12 11:43:44.468470"], ["user_id", nil]]

  def update
    respond_to do |format|
      if @report.update(report_params)
---
UPDATE "reports" SET "mark" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["mark", "C"], ["updated_at", "2023-08-12 14:10:14.406509"], ["id", 7]]

  def destroy
    @report.destroy
---
DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 1]]

  def add_mark
    @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]