labs_report_hw_6/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "gisagi@mailinator.com"], ["first_name", "Dylan"], ["last_name", "Stephenson"], ["created_at", "2023-08-12 13:15:50.614296"], ["updated_at", "2023-08-12 13:15:50.614296"]]